const data = [
  {
    id: 1,
    cover:
      "https://www.cointribune.com/app/uploads/2021/08/4-prichiny-predstojashhego-rosta-kursa-bitcoin-btc-b32f43b.jpg",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
  {
    id: 2,
    cover:
      "https://ambcrypto.com/wp-content/uploads/2022/11/hp-3-fi-4-e1669377797569.png",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
  {
    id: 3,
    cover:
      "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iHQi8ltttb4U/v0/1200x-1.jpg",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
  {
    id: 4,
    cover:
      "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
  {
    id: 5,
    cover:
      "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
  {
    id: 6,
    cover:
      "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
    title: "ژانویه معمولا ماه خوبی برای بیت‌کوین نیست!",
    description:
      "از نظر تاریخی، ماه ژانویه معمولا ماه چندان مطلوبی برای بیت کوین نبوده است؛ ولی آیا فوریه می‌تواند ورق را برگرداند؟",
    content:
      "<p>بهگزارششبکهاطلاع‌رسانیطلاوارزبهنقلازکوین‌پدیا،2022،سالیسراسرسردوتاریکبرایکریپتوبودهاست.قیمتبیتکوین(BTC)درطولسال2022بهشدتکاهشیافت.پادشاهارزهایدیجیتالدرطولاینسالتقریبا70درصدازارزشخودراازدستدادهاست.باوجوداین،وضعیتبازارکریپتوپسازفروپاشیصرافیبزرگاف‌تی‌ایکسبسیاروخیم‌ترنیزشدهاست.اکنونکهدوروزبیش‌ترتاپایاناینسالسختباقینمانده،همه‌ینگاه‌هابهبیت‌کویندوختهشدهتاببینندآیاسال2023رانیزنزولیآغازخواهدکردیاخیر.بهاعتقادیکیازکارشناسانبرجسته‌یبازارکریپتوباناممستعاردانکریپتودرتوییتر،ژانویهازنظرتاریخیماهمطلوبیبرایبیتکویننبودهاست.ویاینادعایخودراباداده‌هایتاریخیبازارکریپتوثابتکردهاست.بهگفته‌یاینکارشناس،ازسال2013تاکنون60درصدازماه‌هایژانویهمنجربهبازده‌یمنفیبیتکوینوایجادکندل‌هایقرمزبرایقیمتاینارزدیجیتالشده‌اند.</p><imgsrc='https://platform.tgju.org/images/normal/news/1401-10/dfjhgdfdjkghdfjkghdfkg.jpg'alt><p>درمقابل،ویمعتقداستماهفوریهتاکنونبهترینماهبرای«بازگشت»بیتکوینبودهاست.ویدراینخصوصگفتهاست:«فوریهیکیازبهترینماه‌هابرایبازگشتصعودیقیمتبیتکوینبودهاست.البته،بهخاطرداشتهباشیدکهاینداده‌هاشاخصقابلاعتمادیبرایرفتارقیمتبیتکویندرآیندهنیستند.همیشهایناحتمالوجودداردکهقیمتیکداراییبرخلافروالهمیشگیخودرفتارکند.»</p><h2>بیتکوینامروز</h2><p>بیتکوینامروزدرمحدوده‌یمیانکف16,497.56دلارتاسقف16,768.17دلارمعاملهمی‌شود.بهاعتقاداینکارشناسبازار،اکنونهمه‌ی‌نگاه‌هابهمنطقه‌یمیان16.9تا17هزاردلاراست.مدت‌هااستکهبیتکوینقادرنبودهاستازاینمحدودهبهسمتبالاعبورکند.ولیعبوربیتکوینازاینمحدودهمی‌تواندشرایطراتغییردهد.</p><blockquote><p>همان‌طورکهگفتهشد،بیتکوین<strong>مدت‌ها</strong>استدریکمحدوده‌یقیمتثابتدرنوساناست؛بههمیندلیل،یکیدیگرازتحلیلگرانبرجسته‌یبازارکریپتوبهنامالیمارتینزبهایننتیجهرسیدهاستکهجهتروندآتیقیمتبیتکوینفقطبایکبریک‌اوتازدوسطح16,000و17,000دلارمشخصخواهدشد.</p></blockquote><ul><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;buytheticket&nbsp;</span></li><li><labelcontenteditable='false'><inputtype='checkbox'tabindex='-1'checked='checked'></label><span>&nbsp;startyouradventure&nbsp;</span></li></ul><p>درادامهباویدیو</p>",
    creation_date: "",
    likes: 232,
    views: 2000,
    related_blogs: [
      {
        id: 2,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 10,
        views: 20,
      },
      {
        id: 3,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 120,
        views: 200,
      },
      {
        id: 4,
        cover:
          "https://media-cdn.tripadvisor.com/media/photo-s/0b/65/b6/50/hotel-imaage.jpg",
        title: "",
        description: "",
        creation_date: "",
        likes: 20210,
        views: 420150,
      },
    ],
    next_prev: { prev: null, next: { title: "", id: 2 } },
    video: "",
  },
];

export default defineEventHandler(async (event) => {
  if (event.req.method === "GET") {
    const query = useQuery(event);
    const offset = +query.offset;
    const limit = +query.limit;
    return data.splice(offset, offset + limit);
  }
});
